org/devops/cryptography.org
#+title: Cryptography Cheat Sheet for Developers
#+description: With Examples in Haskell!
#+keywords: devops,secops,haskell,cryptography,security,cipher,symmetric,asymmetric,hmac,pbkdf,scrypt,bcrypt,curve25519,ecc,rsa,dsa,ecdsa
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Cryptography Cheat Sheet for Developers" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="With Examples in Haskell!" />
#+HTML_HEAD_EXTRA: <meta property="og:type" content="article" />
#+author: Jichao Ouyang
#+date: <2022-09-17 Sat>
#+index: DevOps!Cryptography Cheat Sheet for Developers

This is just a quick reference of cryptography, for developers just be able to tell when and how to use what. Click the reference links(and links there(and links there...)) +to read+ to chase the raddit.

#+begin_quote
RULE No.1 of cryptography: DO NOT implement or invent new cipher yourself!!!
#+end_quote

Haskell is chosen as programming language for examples since it is concise, interactive, typesafe and cryptonite![fn:8]

* The Sheet
|                 |          | Variants/Schemes                |
|-----------------+----------+---------------------------------|
| [[*Encoding][Encoding/Format]] | [[*Base][Base]]     | Base16 Base32 Base64            |
|                 | X.509    |                                 |
|                 | JWT      | [[* JSON Web Signature (JWS)\[fn:22\]][JWS]] [[* JSON Web Encryption (JWE)\[fn:23\]][JWE]] JWK                     |
|                 | PEM      |                                 |
|                 | [[* Public Key Cryptography Standard(PKCS)\[fn:14\]][PKCS]]     | PKCS1 PKCS5 PKCS8 PKCS12/PFX    |
|-----------------+----------+---------------------------------|
| [[* Hash Function][Hash]]            | MD5      |                                 |
|                 | SHA      | SHA1 SHA2 SHA3                  |
|                 | BLAKE2   | Blake2b Black2s                 |
|-----------------+----------+---------------------------------|
| [[* Message Authentication Code(MAC)][MAC]]             | HMAC     |                                 |
|                 | Poly1305 |                                 |
|-----------------+----------+---------------------------------|
| [[* Key Derivation Function(KDF)][KDF]]             | [[*Password Based Key Derivation Function (PBKDF2)\[fn:6\]][PBKDF2]]   |                                 |
|                 | [[*HMAC-based Extract-and-Expand Key Derivation Function (HKDF)\[fn:9\]][HKDF]]     |                                 |
|                 | Bcrypt   |                                 |
|                 | [[*Scrypt\[fn:5\]][Scrypt​]]   |                                 |
|-----------------+----------+---------------------------------|
| [[* Symmetric Ciphers][Symetric]]        | AES      | AES-GCM [[* Galois/Counter Mode\[fn:11\] Synthetic Initialization Vector (GCM-SIV)\[fn:12\]][AES-GCM-SIV]]             |
|                 |          |                                 |
|                 | ChaCha20 | [[* ChaCha20-Poly1305\[fn:13\]][ChaCha20-Poly1305]]               |
|-----------------+----------+---------------------------------|
| [[* Asymmetric Ciphers][Asymetric]]       | ECC      | ECDSA EdDSA ECDH X25519 Ed25519 |
|                 |          |                                 |
|                 | RSA      |                                 |

* Prerequisites
  All you need is just [[https://nixos.org/download.html#download-nix][nix]]!

  All codes in examples are executable in interative repl GHCi.
  
  Please run the following to get into GHCi and config it correctly before trying any example.
  #+begin_example
    nix-shell -p "haskellPackages.ghcWithPackages (pkgs: [ pkgs.cryptonite pkgs.memory ])" --run ghci
    GHCi, version 9.0.2: https://www.haskell.org/ghc/  :? for help
    ghci> :set -XOverloadedStrings
    ghci> import Data.ByteString
  #+end_example

  =openssl= CLI will be used in few examples as well.

* Encoding
  #+index: encoding

  #+begin_quote
  Encoding is not Encryption!!! It is just converting bytes from one format to another, for purposes like easier to store, transit etc. Although it looks scrambled, any one can convert it back and forth.
  #+end_quote

