devops/cryptography.html

<div id="outline-container-orgecda775" class="outline-3">
<h3 id="orgecda775">Base</h3>
<div class="outline-text-3" id="text-orgecda775">
<p>
Most developers are very familiar with <code>base64</code><label for="2" class="margin-toggle sidenote-number"></label><input type="checkbox" id="2" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc4648">https://datatracker.ietf.org/doc/html/rfc4648</a> 
</span>
</p>
<pre class="example" id="org04c7655">
ghci&gt; import Data.ByteArray.Encoding
ghci&gt; convertToBase Base64 ("hello world" :: ByteString) :: ByteString
"aGVsbG8gd29ybGQ="
ghci&gt; convertFromBase Base64 ("aGVsbG8gd29ybGQ=" :: ByteString) :: Either String ByteString
Right "hello world"
ghci&gt; convertToBase Base16 ("hello world" :: ByteString) :: ByteString
"68656c6c6f20776f726c64"
ghci&gt; convertFromBase Base16 ("68656c6c6f20776f726c64" :: ByteString) :: Either String ByteString
Right "hello world"
</pre>

<p>
The number 64 or 16 indicates how large the alphabets table is. The larger the table, usually the shorter encoded message.
</p>

<p>
For instance base64 has 64 alphabets(actually 63, <code>=</code> is for padding), hence each alphabet can describe 2^6 aka 6bit.
</p>

<p>
base16 is basically just hex since one alphabet map to 2^4(4bit) using US-ASCII.
</p>

<p>
The following example of base64 data from message "hel" <label for="3" class="margin-toggle sidenote-number"></label><input type="checkbox" id="3" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc4648#section-9">https://datatracker.ietf.org/doc/html/rfc4648#section-9</a> 
</span>
</p>

<pre class="example" id="orgb90b4ca">
Input:   h        e        l
Hex:     6   8    6   5    6   c  
8-bit:   01101000 01100101 01101100
6-bit:   011010 000110 010101 1101100
Decimal: 26     6      21     44     
Output:  a      G      V      s      
</pre>
</div>
</div>

<div id="outline-container-org8295e95" class="outline-3">
<h3 id="org8295e95">Privacy-Enhanced Mail(PEM)<label for="4" class="margin-toggle sidenote-number"></label><input type="checkbox" id="4" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc1421">https://datatracker.ietf.org/doc/html/rfc1421</a>
</span></h3>
<div class="outline-text-3" id="text-org8295e95">
<p>
PEM is baseline format for most of the public key encryption, which contains
</p>
<ul class="org-ul">
<li>Boudary</li>
<li>Headers</li>
<li>Body</li>
</ul>

<p>
Example PEM:
</p>
<pre class="example" id="orgd70f492">
-----BEGIN PRIVACY-ENHANCED MESSAGE-----
Proc-Type: 4,ENCRYPTED
Content-Domain: RFC822
DEK-Info: DES-CBC,F8143EDE5960C597
Originator-ID-Symmetric: linn@zendia.enet.dec.com,,
Recipient-ID-Symmetric: linn@zendia.enet.dec.com,ptf-kmc,3
Key-Info: DES-ECB,RSA-MD2,9FD3AAD2F2691B9A,
          B70665BB9BF7CBCDA60195DB94F727D3
Recipient-ID-Symmetric: pem-dev@tis.com,ptf-kmc,4
Key-Info: DES-ECB,RSA-MD2,161A3F75DC82EF26,
          E2EF532C65CBCFF79F83A2658132DB47

LLrHB0eJzyhP+/fSStdW8okeEnv47jxe7SJ/iN72ohNcUk2jHEUSoH1nvNSIWL9M
8tEjmF/zxB+bATMtPjCUWbz8Lr9wloXIkjHUlBLpvXR0UrUzYbkNpk0agV2IzUpk
J6UiRRGcDSvzrsoK+oNvqu6z7Xs5Xfz5rDqUcMlK1Z6720dcBWGGsDLpTpSCnpot
dXd/H5LMDWnonNvPCwQUHt==
-----END PRIVACY-ENHANCED MESSAGE-----
</pre>
</div>
</div>

<div id="outline-container-org84ae3a0" class="outline-3">
<h3 id="org84ae3a0">Public Key Cryptography Standard(PKCS)<label for="5" class="margin-toggle sidenote-number"></label><input type="checkbox" id="5" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc5958">https://datatracker.ietf.org/doc/html/rfc5958</a>
</span></h3>
<div class="outline-text-3" id="text-org84ae3a0">
<p>
There are a lot of PKCS #X standards, maybe the most common one is RSA keys since you
may have seen it quite often(something like <code>server.key</code>) when updating a website's certiciate.
</p>
</div>
<div id="outline-container-orge92c707" class="outline-4">
<h4 id="orge92c707">PKCS #8</h4>
<div class="outline-text-4" id="text-orge92c707">
<p>
PKCS8 in usually used as syntax of unencrypted RSA private key,
</p>

<p>
you can simply generate a rsa key via openssl:
</p>
<pre class="example" id="orgddf8caa">
nix-shell -p openssl
[nix-shell:/tmp]$ openssl genpkey -algorithm rsa -out test.key
[nix-shell:/tmp]$ cat test.key
-----BEGIN PRIVATE KEY-----
MIIEvwIBADANBgkqhkiG9w0BAQEFAASCBKkwggSlAgEAAoIBAQC6LU2ZNdy32+HL
...
c581/XSSIu1kZpptICNGM4MiDJyGoysNX7417wXgwr8YEb6fbMAMGjjYKbF9BlpY
yRdkNiEmIKL4/ZQoTLdyQR4vJQ==
-----END PRIVATE KEY-----
</pre>

<pre class="example" id="orge1341d8">
[nix-shell:/tmp]$ openssl rsa -in test.key -noout -text
RSA Private-Key: (2048 bit, 2 primes)
modulus:
    00:e9:6a:68:ab:7b:73:f0:14:72:24:e5:35:f1:c2:
    ...
publicExponent: 65537 (0x10001)
privateExponent:
    00:c0:6f:a1:11:d7:ba:f2:f0:f8:56:20:be:c3:ad:
    ...
prime1:
    00:fb:d7:d5:fd:2c:b5:b2:cd:92:b0:ea:60:83:29:
    ...
prime2:
    ...
exponent1:
    00:e5:8f:16:15:92:9d:85:00:71:c8:25:bc:17:92:
    ...
exponent2:
    3e:6e:01:ad:b7:63:36:96:90:f9:ed:38:c4:10:bf:
    ...
coefficient:
    00:89:e1:69:2b:78:97:a9:91:88:39:7a:75:08:f0:
    ...
</pre>

<p>
The output is readable text but the original PKCS8 is in Abstract Syntax Notation One(ASN.1)<label for="6" class="margin-toggle sidenote-number"></label><input type="checkbox" id="6" class="margin-toggle"/><span class="sidenote">
<a href="https://www.itu.int/en/ITU-T/asn1/Pages/introduction.aspx">https://www.itu.int/en/ITU-T/asn1/Pages/introduction.aspx</a>
</span> syntax and DER encoded.
</p>

<p>
Private key is kind of too long as example, lets use public key to explain.
</p>
</div>
</div>
<div id="outline-container-org25be44f" class="outline-4">
<h4 id="org25be44f">PKCS #1</h4>
<div class="outline-text-4" id="text-org25be44f">
<p>
RSA Public key can be generate from private key:
</p>

<pre class="example" id="org7ef60b2">
[nix-shell:/tmp]$ openssl rsa -in test.key -outform PEM -pubout
writing RSA key
-----BEGIN PUBLIC KEY-----
MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA6Wpoq3tz8BRyJOU18cJK
D+4lVGBz94lpRLfAAK3mjEWbIbeQ/uElnyGbq0Fe+XRMBdVpI5B5PQbM8kf6sNYv
n7BM+dRVq1LuRGmxjL/i+CW7VRWiIZxHWNF/eCaqn3j2hij81NK22m13eFMSOELo
76G6TDtEbv5rqJdhrJw6BlCbslHXNr4rT+q0R2ajricbY/xig/bz6mOetjgxoL6X
WiuJibtAYqGa7+iQse1icFz3SWCwwZjYE46uW1rUI7iyugRBhdVMiypPDj00wdak
77NiaiFw91Vl1EfZo09b8ztcSjBKWeE0tte8Iy5+AhKsC59/hE2wIFj5TnxVE4JC
kwIDAQAB
-----END PUBLIC KEY-----
</pre>

<p>
The output of the public key is in PKCS1 in ASN.1 syntax DER encoded in PEM format.
</p>

<p>
PKCS1 represent RSA public key ASN.1 as
</p>
<pre class="example" id="org43e749d">
RSAPublicKey:

      RSAPublicKey ::= SEQUENCE {
          modulus           INTEGER,  -- n
          publicExponent    INTEGER   -- e
      }
</pre>

<p>
You can read the same information as ASN.1 from
</p>
<pre class="example" id="org15e444a">
[nix-shell:/tmp]$ openssl rsa -in test.key -pubout -out test.pem
[nix-shell:/tmp]$ openssl rsa -in test.pem -pubin -noout -text
RSA Public-Key: (2048 bit)
Modulus:
    00:e9:6a:68:ab:7b:73:f0:14:72:24:e5:35:f1:c2:
    4a:0f:ee:25:54:60:73:f7:89:69:44:b7:c0:00:ad:
    e6:8c:45:9b:21:b7:90:fe:e1:25:9f:21:9b:ab:41:
    5e:f9:74:4c:05:d5:69:23:90:79:3d:06:cc:f2:47:
    fa:b0:d6:2f:9f:b0:4c:f9:d4:55:ab:52:ee:44:69:
    b1:8c:bf:e2:f8:25:bb:55:15:a2:21:9c:47:58:d1:
    7f:78:26:aa:9f:78:f6:86:28:fc:d4:d2:b6:da:6d:
    77:78:53:12:38:42:e8:ef:a1:ba:4c:3b:44:6e:fe:
    6b:a8:97:61:ac:9c:3a:06:50:9b:b2:51:d7:36:be:
    2b:4f:ea:b4:47:66:a3:ae:27:1b:63:fc:62:83:f6:
    f3:ea:63:9e:b6:38:31:a0:be:97:5a:2b:89:89:bb:
    40:62:a1:9a:ef:e8:90:b1:ed:62:70:5c:f7:49:60:
    b0:c1:98:d8:13:8e:ae:5b:5a:d4:23:b8:b2:ba:04:
    41:85:d5:4c:8b:2a:4f:0e:3d:34:c1:d6:a4:ef:b3:
    62:6a:21:70:f7:55:65:d4:47:d9:a3:4f:5b:f3:3b:
    5c:4a:30:4a:59:e1:34:b6:d7:bc:23:2e:7e:02:12:
    ac:0b:9f:7f:84:4d:b0:20:58:f9:4e:7c:55:13:82:
    42:93
Exponent: 65537 (0x10001)
</pre>

<p>
So far all these PKCS are UNENCRYPTED, they are just encoded in certain format.
</p>

<p>
There is a common standard for store and exchange certs and keys that is encypted - PKCS #12 Personal Information Exchange Syntax<label for="7" class="margin-toggle sidenote-number"></label><input type="checkbox" id="7" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc7292">https://datatracker.ietf.org/doc/html/rfc7292</a>
</span> aka PFX<label for="8" class="margin-toggle sidenote-number"></label><input type="checkbox" id="8" class="margin-toggle"/><span class="sidenote">
This is the common format when you get a new cert.
</span>
</p>
</div>
</div>
</div>

<div id="outline-container-org57ca379" class="outline-3">
<h3 id="org57ca379">JSON Web Token(JWT)<label for="9" class="margin-toggle sidenote-number"></label><input type="checkbox" id="9" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc7519">https://datatracker.ietf.org/doc/html/rfc7519</a>
</span></h3>
<div class="outline-text-3" id="text-org57ca379">
<div class="epigraph"><blockquote>
<p>
JSON Web Token (JWT) is a compact, URL-safe means of representing claims to be transferred between two parties
</p>

</blockquote></div>
<p>
JWT is either a JWS or JWE
</p>
</div>
