org/devops/cryptography.org
*** JSON Web Signature (JWS)[fn:22]
JWS is commonly used in OIDC[fn:24] as =id_token= and sometimes =access_token= too.

The message is NOT ENCTYPTED, so anyone can actually see the claims in the JSON.
#+begin_example
  BASE64URL(UTF8(JWS Protected Header)) || '.' ||
  BASE64URL(JWS Payload) || '.' ||
  BASE64URL(JWS Signature)
#+end_example

A example of JWS:(with line breaks for display purposes only):
#+begin_example
  eyJ0eXAiOiJKV1QiLA0KICJhbGciOiJIUzI1NiJ9
  .
  eyJpc3MiOiJqb2UiLA0KICJleHAiOjEzMDA4MTkzODAsDQogImh0dHA6Ly9leGFt
  cGxlLmNvbS9pc19yb290Ijp0cnVlfQ
  .
  dBjftJeZ4CVP-mB92K27uhbUJU1p1r_wW1gFWFOEjXk
#+end_example

JWS Signature basically is MAC, of =header || payload=

*** JSON Web Encryption (JWE)[fn:23]
As the name indicate JWE can be use to encrypt messages, JWE is in the following format, where Ciphertext is the encrypted
message.

#+begin_example
  BASE64URL(UTF8(JWE Protected Header)) ||
        '.' || BASE64URL(JWE Encrypted Key) || '.' || BASE64URL(JWE
        Initialization Vector) || '.' || BASE64URL(JWE Ciphertext) || '.'
        || BASE64URL(JWE Authentication Tag)
#+end_example

example:(with line breaks for display purposes only)
#+begin_example
  eyJhbGciOiJSU0EtT0FFUCIsImVuYyI6IkEyNTZHQ00ifQ.
  OKOawDo13gRp2ojaHV7LFpZcgV7T6DVZKTyKOMTYUmKoTCVJRgckCL9kiMT03JGe
  ipsEdY3mx_etLbbWSrFr05kLzcSr4qKAq7YN7e9jwQRb23nfa6c9d-StnImGyFDb
  Sv04uVuxIp5Zms1gNxKKK2Da14B8S4rzVRltdYwam_lDp5XnZAYpQdb76FdIKLaV
  mqgfwX7XWRxv2322i-vDxRfqNzo_tETKzpVLzfiwQyeyPGLBIO56YJ7eObdv0je8
  1860ppamavo35UgoRdbYaBcoh9QcfylQr66oc6vFWXRcZ_ZT2LawVCWTIy3brGPi
  6UklfCpIMfIjf7iGdXKHzg.
  48V1_ALb6US04U3b.
  5eym8TW_c8SuK0ltJ3rpYIzOeDQz7TALvtu6UG9oMo4vpzs9tX_EFShS8iB7j6ji
  SdiwkIr3ajwQzaBtQD_A.
  XFBoMYUZodetZdvTiFvSkQ
#+end_example

* Hash Function
  #+index: SHA
  #+index: MD5
  #+index: Blake

  Hash function can map bytes to another ONE WAY only but not the other way around.
  Common hash functions are SHA2, SHA3, MD5, Blake2...
  Modern hash functions such as SHA2, SHA3, Blake2 are consider secure hash functions. Old funtions such as MD5 and SHA1 are not secure since collisions found, and should avoid using them.

  Hash functions are commonly used to proof the content not tampered, for example if you download an executable file form internet, you should compare the hash provided by the site and the one caclulated locally. Collisions found will indicate the function is not secure anymore, for example if someone hijack the content and replace with another malware which can calculate to the same hash.

  #+begin_example
        ghci> import Crypto.Hash
        ghci> hash ("hello world"::ByteString) :: Digest SHA1
        2aae6c35c94fcfb415dbe95f408b9ce91ee846ed
        ghci> hash ("hello world"::ByteString) :: Digest MD5
        5eb63bbbe01eeed093cb22bb8f5acdc3
        ghci> hash ("hello world"::ByteString) :: Digest SHA256
        b94d27b9934d3e08a52e52d7da7dabfac484efe37a5380ee9088f7ace2efcde9
        ghci> hash ("hello world"::ByteString) :: Digest SHA3_256
        644bcc7e564373040999aac89e7622f3ca71fba1d972fd94a31c3bfbf24e3938
        ghci> hash ("hello world"::ByteString) :: Digest Blake2s_256
        9aec6806794561107e594b1f6a8a6b0c92a0cba9acf5e5e93cca06f781813b0b
        ghci> hash ("hello world"::ByteString) :: Digest Blake2b_256
        256c83b297114d201b30179f3f0ef0cace9783622da5974326b436178aeef610
  #+end_example

  The number =256= in SHA and Blake indicates the output bits length, usually more bits means higher collisions resistance.

  #+begin_quote
  Hashing is NOT encryption!!! DO NOT store hash of password in database. Although hash function is not reversible, if I have a large enough dictionary, I can definitly tell from database the password =5eb63bbbe01eeed093cb22bb8f5acdc3= is =hello world=
  #+end_quote

  There is example of Blake2b of "abc" and C implementation in rfc7693 [fn:3]
  
* Message Authentication Code(MAC)
  #+index: HMAC
  MAC is basically a hash function + key.

  For example HMAC SHA256 is HMAC scramble the message with a key and hash with SHA256.
  
  #+begin_example
    ghci> import Crypto.MAC.HMAC
    ghci> import Crypto.Hash
    ghci> hmacGetDigest $ hmac ("secret key"::ByteString) ("hello world"::ByteString) :: Digest SHA256
    c61b5198df58639edb9892514756b89a36856d826e5d85023ab181b48ea5d018
    ghci> hmacGetDigest $ hmac ("secret key"::ByteString) ("hello world"::ByteString) :: Digest Blake2b_256
    198e317eba56eee5056b88f527c895d6235ace9153fdf6467e38c2758073328c
  #+end_example

  The scramble part is defined in rfc2104[fn:4], =H= is hash function e.g. SHA256, =K= is secret key and =,= is concat
   #+begin_example
     ipad = the byte 0x36 repeated B times
     opad = the byte 0x5C repeated B times
     H(K XOR opad, H(K XOR ipad, text))
   #+end_example

   MAC can be used in senario like:

    - Exchange private message, append a MAC of the message to proof it is not tampered, very similar to usage of hash function, but hash function is mainly use for public messages, for example a file from public website that everyone can download.
    - Pseudo Random Generator(PRG),  =HMAC(salt, seed)= generate a pretty random enough key can be used in KDF



** Poly1305[fn:13]
* Key Derivation Function(KDF)
  KDF is a function generates pseudo random key from password. Password is something we usually used to encrypt a file, or login to a website, because it is easy to remember or note for human, but not random enough to use directly as key to encrypt, and not secure to store in database.

  You can think of KDF as just MAC, but run many iterations and consume some CPU and RAM.

