devops/cryptography.html
<div id="outline-container-orge302425" class="outline-4">
<h4 id="orge302425">JSON Web Signature (JWS)<label for="10" class="margin-toggle sidenote-number"></label><input type="checkbox" id="10" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc7515">https://datatracker.ietf.org/doc/html/rfc7515</a>
</span></h4>
<div class="outline-text-4" id="text-orge302425">
<p>
JWS is commonly used in OIDC<label for="11" class="margin-toggle sidenote-number"></label><input type="checkbox" id="11" class="margin-toggle"/><span class="sidenote">
<a href="https://openid.net/specs/openid-connect-core-1_0.html">https://openid.net/specs/openid-connect-core-1_0.html</a> 
</span> as <code>id_token</code> and sometimes <code>access_token</code> too.
</p>

<p>
The message is NOT ENCTYPTED, so anyone can actually see the claims in the JSON.
</p>
<pre class="example" id="orgd53a15f">
BASE64URL(UTF8(JWS Protected Header)) || '.' ||
BASE64URL(JWS Payload) || '.' ||
BASE64URL(JWS Signature)
</pre>

<p>
A example of JWS:(with line breaks for display purposes only):
</p>
<pre class="example" id="org02b9295">
eyJ0eXAiOiJKV1QiLA0KICJhbGciOiJIUzI1NiJ9
.
eyJpc3MiOiJqb2UiLA0KICJleHAiOjEzMDA4MTkzODAsDQogImh0dHA6Ly9leGFt
cGxlLmNvbS9pc19yb290Ijp0cnVlfQ
.
dBjftJeZ4CVP-mB92K27uhbUJU1p1r_wW1gFWFOEjXk
</pre>

<p>
JWS Signature basically is MAC, of <code>header || payload</code>
</p>
</div>
</div>

<div id="outline-container-org2deab78" class="outline-4">
<h4 id="org2deab78">JSON Web Encryption (JWE)<label for="12" class="margin-toggle sidenote-number"></label><input type="checkbox" id="12" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc7516">https://datatracker.ietf.org/doc/html/rfc7516</a> 
</span></h4>
<div class="outline-text-4" id="text-org2deab78">
<p>
As the name indicate JWE can be use to encrypt messages, JWE is in the following format, where Ciphertext is the encrypted
message.
</p>

<pre class="example" id="orgecb0ee9">
BASE64URL(UTF8(JWE Protected Header)) ||
      '.' || BASE64URL(JWE Encrypted Key) || '.' || BASE64URL(JWE
      Initialization Vector) || '.' || BASE64URL(JWE Ciphertext) || '.'
      || BASE64URL(JWE Authentication Tag)
</pre>

<p>
example:(with line breaks for display purposes only)
</p>
<pre class="example" id="org2d6b029">
eyJhbGciOiJSU0EtT0FFUCIsImVuYyI6IkEyNTZHQ00ifQ.
OKOawDo13gRp2ojaHV7LFpZcgV7T6DVZKTyKOMTYUmKoTCVJRgckCL9kiMT03JGe
ipsEdY3mx_etLbbWSrFr05kLzcSr4qKAq7YN7e9jwQRb23nfa6c9d-StnImGyFDb
Sv04uVuxIp5Zms1gNxKKK2Da14B8S4rzVRltdYwam_lDp5XnZAYpQdb76FdIKLaV
mqgfwX7XWRxv2322i-vDxRfqNzo_tETKzpVLzfiwQyeyPGLBIO56YJ7eObdv0je8
1860ppamavo35UgoRdbYaBcoh9QcfylQr66oc6vFWXRcZ_ZT2LawVCWTIy3brGPi
6UklfCpIMfIjf7iGdXKHzg.
48V1_ALb6US04U3b.
5eym8TW_c8SuK0ltJ3rpYIzOeDQz7TALvtu6UG9oMo4vpzs9tX_EFShS8iB7j6ji
SdiwkIr3ajwQzaBtQD_A.
XFBoMYUZodetZdvTiFvSkQ
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0d0ad90" class="outline-2">
<h2 id="org0d0ad90">Hash Function</h2>
<div class="outline-text-2" id="text-org0d0ad90">
<p>
Hash function can map bytes to another ONE WAY only but not the other way around.
Common hash functions are SHA2, SHA3, MD5, Blake2&#x2026;
Modern hash functions such as SHA2, SHA3, Blake2 are consider secure hash functions. Old funtions such as MD5 and SHA1 are not secure since collisions found, and should avoid using them.
</p>

<p>
Hash functions are commonly used to proof the content not tampered, for example if you download an executable file form internet, you should compare the hash provided by the site and the one caclulated locally. Collisions found will indicate the function is not secure anymore, for example if someone hijack the content and replace with another malware which can calculate to the same hash.
</p>

<pre class="example" id="org20c853b">
ghci&gt; import Crypto.Hash
ghci&gt; hash ("hello world"::ByteString) :: Digest SHA1
2aae6c35c94fcfb415dbe95f408b9ce91ee846ed
ghci&gt; hash ("hello world"::ByteString) :: Digest MD5
5eb63bbbe01eeed093cb22bb8f5acdc3
ghci&gt; hash ("hello world"::ByteString) :: Digest SHA256
b94d27b9934d3e08a52e52d7da7dabfac484efe37a5380ee9088f7ace2efcde9
ghci&gt; hash ("hello world"::ByteString) :: Digest SHA3_256
644bcc7e564373040999aac89e7622f3ca71fba1d972fd94a31c3bfbf24e3938
ghci&gt; hash ("hello world"::ByteString) :: Digest Blake2s_256
9aec6806794561107e594b1f6a8a6b0c92a0cba9acf5e5e93cca06f781813b0b
ghci&gt; hash ("hello world"::ByteString) :: Digest Blake2b_256
256c83b297114d201b30179f3f0ef0cace9783622da5974326b436178aeef610
</pre>

<p>
The number <code>256</code> in SHA and Blake indicates the output bits length, usually more bits means higher collisions resistance.
</p>

<div class="epigraph"><blockquote>
<p>
Hashing is NOT encryption!!! DO NOT store hash of password in database. Although hash function is not reversible, if I have a large enough dictionary, I can definitly tell from database the password <code>5eb63bbbe01eeed093cb22bb8f5acdc3</code> is <code>hello world</code>
</p>

</blockquote></div>

<p>
There is example of Blake2b of "abc" and C implementation in rfc7693 <label for="13" class="margin-toggle sidenote-number"></label><input type="checkbox" id="13" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc7693#appendix-A">https://datatracker.ietf.org/doc/html/rfc7693#appendix-A</a> 
</span>
</p>
</div>
</div>

<div id="outline-container-org2004a58" class="outline-2">
<h2 id="org2004a58">Message Authentication Code(MAC)</h2>
<div class="outline-text-2" id="text-org2004a58">
<p>
MAC is basically a hash function + key.
</p>

<p>
For example HMAC SHA256 is HMAC scramble the message with a key and hash with SHA256.
</p>

<pre class="example" id="org4184bc1">
ghci&gt; import Crypto.MAC.HMAC
ghci&gt; import Crypto.Hash
ghci&gt; hmacGetDigest $ hmac ("secret key"::ByteString) ("hello world"::ByteString) :: Digest SHA256
c61b5198df58639edb9892514756b89a36856d826e5d85023ab181b48ea5d018
ghci&gt; hmacGetDigest $ hmac ("secret key"::ByteString) ("hello world"::ByteString) :: Digest Blake2b_256
198e317eba56eee5056b88f527c895d6235ace9153fdf6467e38c2758073328c
</pre>

<p>
The scramble part is defined in rfc2104<label for="14" class="margin-toggle sidenote-number"></label><input type="checkbox" id="14" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc2104">https://datatracker.ietf.org/doc/html/rfc2104</a> 
</span>, <code>H</code> is hash function e.g. SHA256, <code>K</code> is secret key and <code>,</code> is concat
</p>
<pre class="example" id="org08caf6d">
ipad = the byte 0x36 repeated B times
opad = the byte 0x5C repeated B times
H(K XOR opad, H(K XOR ipad, text))
</pre>

<p>
MAC can be used in senario like:
</p>

<ul class="org-ul">
<li>Exchange private message, append a MAC of the message to proof it is not tampered, very similar to usage of hash function, but hash function is mainly use for public messages, for example a file from public website that everyone can download.</li>
<li>Pseudo Random Generator(PRG),  <code>HMAC(salt, seed)</code> generate a pretty random enough key can be used in KDF</li>
</ul>
</div>



<div id="outline-container-orge8c8c3c" class="outline-3">
<h3 id="orge8c8c3c">Poly1305<label for="15" class="margin-toggle sidenote-number"></label><input type="checkbox" id="15" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc8439">https://datatracker.ietf.org/doc/html/rfc8439</a>
</span></h3>
</div>
</div>
<div id="outline-container-org9e02139" class="outline-2">
<h2 id="org9e02139">Key Derivation Function(KDF)</h2>
<div class="outline-text-2" id="text-org9e02139">
<p>
KDF is a function generates pseudo random key from password. Password is something we usually used to encrypt a file, or login to a website, because it is easy to remember or note for human, but not random enough to use directly as key to encrypt, and not secure to store in database.
</p>

<p>
You can think of KDF as just MAC, but run many iterations and consume some CPU and RAM.
</p>
</div>
