org/devops/cryptography.org
** Password Based Key Derivation Function (PBKDF2)[fn:6]
   The following example of PBKDF using HMAC SHA256, iterate 1000 times, and output length 32 bytes.
   #+begin_example
     ghci> import Crypto.KDF.PBKDF2
     ghci> generate (prfHMAC SHA256 :: PRF ByteString) (Parameters {iterCounts = 1000, outputLength = 32}) ("password":: ByteString) ("salt"::ByteString) :: ByteString
     "c,(\DC2\228mF\EOT\DLE+\167a\142\157m}/\129(\246&kJ\ETX&M*\EOT`\183\220\179"
   #+end_example
   The output is 32 bytes length pseudo random bytestring, we can output hex format with base16 encoding

   #+begin_example
     ghci> convertToBase Base16 $ (generate (prfHMAC SHA256 :: PRF ByteString) (Parameters {iterCounts = 1000, outputLength = 32}) ("password":: ByteString) ("salt"::ByteString) :: ByteString) :: ByteString
     "632c2812e46d4604102ba7618e9d6d7d2f8128f6266b4a03264d2a0460b7dcb3"
   #+end_example

   It is secure to store parameters( _salt_, _iterations count_, _output length_), together with the output bytes in database, in senario such as login, a server can run the same function again with the salt, iterations and length from the record, and compare the output bytes with the one stored in the database.
   
   Since PBKDF2 hash each password with HMAC and a random salt many iterations, it is resistanct to dictionary attacks[fn:7].
   
   PBKDF2 is a common KDF but it is consider less secure than modern KDF such as Scrypt, Argon2.
** Scrypt[fn:5]
    The following is a example of deriving 32 bytes length key in 1024 iterations, block size 8 and parallel 2.
   #+begin_example
     ghci> import Crypto.KDF.Scrypt
     ghci> generate (Parameters {n=1024,r=8,p=2,outputLength=32}) ("password":: ByteString) ("salt"::ByteString) ::ByteString
     "\ETBeHl\244\197Y\DEL\181\&0\141\SYN\185\151\148\215\211\160\189.\148d\185\172\177\202\&2\ETX\SUB\133\223\237"
   #+end_example
** HMAC-based Extract-and-Expand Key Derivation Function (HKDF)[fn:9]

#+begin_example
  ghci> import Crypto.KDF.HKDF
  ghci> import Crypto.Hash (SHA256)
  ghci> let pkr = extract ("salt" :: ByteString) ("secret" :: ByteString) :: PRK SHA256
  ghci| in expand pkr ("payload" :: ByteString) 32 :: ByteString
  "\DC4\147\223\v%\175\f\177\143\132\202\142\233\236\135\153\253\CANs\213wh\149\193\128\240\192t\DC1\UST,"
#+end_example
* Symmetric Ciphers
** AES
AES requires a initial vector(IV), aka nonce

*** Counter Mode(CTR)
The following is a example of AES CTR mode with a random key and 0 iv:
#+begin_quote
In practice key should be generated from one of the secure KDF, and iv should be a random number.
#+end_quote

#+begin_example
  ghci> import Crypto.Random
  ghci> import Crypto.Cipher.Types
  ghci> import Crypto.Cipher.AES (AES256)
  ghci> import Crypto.Error
  ghci> do
  ghci| cipher <- (getRandomBytes 32 :: IO ByteString) >>= (throwCryptoErrorIO . cipherInit) :: IO AES256
  ghci| return $ ctrCombine cipher nullIV ("message"::ByteString)
  ghci| 
  "\208\207\SI\191\206\DELN"
#+end_example

*** Galois/Counter Mode[fn:11] Synthetic Initialization Vector (GCM-SIV)[fn:12]
CTR is good enough for common encryption case, while GCM added Authenticated Encryption with Additional Data (AEAD)[fn:25], and SIV to nonce misuse-resistant.

AEAD basically bind extra data, or context to cipher text and generate a MAC, aka authentication tag, to be able to verify cipher text's integrity(not tampered), and authenticity(not cut-and-paste).

The following is example of AES-GCM-SIV encryption of "message" with additional data "context" and a nonce.

#+begin_example
  ghci> import Crypto.Cipher.AESGCMSIV
  ghci> do
  ghci| key :: ByteString <- getRandomBytes 32
  ghci| nonce <- generateNonce
  ghci| throwCryptoErrorIO $ do
  ghci| aes :: AES256 <- cipherInit key
  ghci| return $ encrypt aes nonce ("context" :: ByteString) ("message" :: ByteString) 
  ghci| 
  (AuthTag {unAuthTag = "\239|\229V\USNT3\ACKf\NAK\STXC\251\134\FS"},"\149\229\142SW\209Z")
#+end_example
** ChaCha20
ChaCha20 is high speed stream cipher, a vairant of Salsa20, usually combine with Poly1305 as AEAD construction.
*** ChaCha20-Poly1305[fn:13]

ChaCha20-Poly1305 requires very similar inputs to AES:

  - a 32 bytes (256-bit) key, can derive key from password with a secure KDF
  - a 12 bytes (96-bit) nonce aka IV

There are more steps to encrypt a message due to it is stream cipher aka state cipher, which is different from block cipher such as AES, block cipher generate fixed length key to encrypt fixed length message, while stream cipher can produce state to generate keystream for next chunk of data.

- AEAD need to add and finalize before encrypt, and cannot modify later on
- encrypt can call multiple times based on current state
- finalise a state will generate auth tag

#+begin_example
ghci> import Crypto.Error
ghci> import Crypto.Cipher.ChaChaPoly1305
ghci| do
ghci| key <- getRandomBytes 32 :: IO ByteString
ghci| nonce <- getRandomBytes 12 :: IO ByteString
ghci| throwCryptoErrorIO $ do
ghci| st1 <- nonce12 nonce >>= initialize key
ghci| let
ghci|   st2 = finalizeAAD $ appendAAD ("context":: ByteString) st1
ghci|   (out, st3) = encrypt ("message":: ByteString) st2
ghci|   auth = finalize st3
ghci| return $ (convertToBase Base16 out :: ByteString, convertToBase Base16 auth :: ByteString)
("f0dd593fb3cac0","4a29dd7ae8b51ac748b37092ed485e88")
#+end_example

* TODO Asymmetric Ciphers

