devops/cryptography.html

<div id="outline-container-org55059fc" class="outline-3">
<h3 id="org55059fc">Password Based Key Derivation Function (PBKDF2)<label for="16" class="margin-toggle sidenote-number"></label><input type="checkbox" id="16" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc2898">https://datatracker.ietf.org/doc/html/rfc2898</a>
</span></h3>
<div class="outline-text-3" id="text-org55059fc">
<p>
The following example of PBKDF using HMAC SHA256, iterate 1000 times, and output length 32 bytes.
</p>
<pre class="example" id="org059a4b8">
ghci&gt; import Crypto.KDF.PBKDF2
ghci&gt; generate (prfHMAC SHA256 :: PRF ByteString) (Parameters {iterCounts = 1000, outputLength = 32}) ("password":: ByteString) ("salt"::ByteString) :: ByteString
"c,(\DC2\228mF\EOT\DLE+\167a\142\157m}/\129(\246&amp;kJ\ETX&amp;M*\EOT`\183\220\179"
</pre>
<p>
The output is 32 bytes length pseudo random bytestring, we can output hex format with base16 encoding
</p>

<pre class="example" id="org74536a3">
ghci&gt; convertToBase Base16 $ (generate (prfHMAC SHA256 :: PRF ByteString) (Parameters {iterCounts = 1000, outputLength = 32}) ("password":: ByteString) ("salt"::ByteString) :: ByteString) :: ByteString
"632c2812e46d4604102ba7618e9d6d7d2f8128f6266b4a03264d2a0460b7dcb3"
</pre>

<p>
It is secure to store parameters( <span class="underline">salt</span>, <span class="underline">iterations count</span>, <span class="underline">output length</span>), together with the output bytes in database, in senario such as login, a server can run the same function again with the salt, iterations and length from the record, and compare the output bytes with the one stored in the database.
</p>

<p>
Since PBKDF2 hash each password with HMAC and a random salt many iterations, it is resistanct to dictionary attacks<label for="17" class="margin-toggle sidenote-number"></label><input type="checkbox" id="17" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc4949#page-102">https://datatracker.ietf.org/doc/html/rfc4949#page-102</a> 
</span>.
</p>

<p>
PBKDF2 is a common KDF but it is consider less secure than modern KDF such as Scrypt, Argon2.
</p>
</div>
</div>
<div id="outline-container-orge20d9d3" class="outline-3">
<h3 id="orge20d9d3">Scrypt<label for="18" class="margin-toggle sidenote-number"></label><input type="checkbox" id="18" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc7914">https://datatracker.ietf.org/doc/html/rfc7914</a>
</span></h3>
<div class="outline-text-3" id="text-orge20d9d3">
<p>
The following is a example of deriving 32 bytes length key in 1024 iterations, block size 8 and parallel 2.
</p>
<pre class="example" id="org26bf316">
ghci&gt; import Crypto.KDF.Scrypt
ghci&gt; generate (Parameters {n=1024,r=8,p=2,outputLength=32}) ("password":: ByteString) ("salt"::ByteString) ::ByteString
"\ETBeHl\244\197Y\DEL\181\&amp;0\141\SYN\185\151\148\215\211\160\189.\148d\185\172\177\202\&amp;2\ETX\SUB\133\223\237"
</pre>
</div>
</div>
<div id="outline-container-org077fd0a" class="outline-3">
<h3 id="org077fd0a">HMAC-based Extract-and-Expand Key Derivation Function (HKDF)<label for="19" class="margin-toggle sidenote-number"></label><input type="checkbox" id="19" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc5869">https://datatracker.ietf.org/doc/html/rfc5869</a>
</span></h3>
<div class="outline-text-3" id="text-org077fd0a">
<pre class="example" id="org7d4760e">
ghci&gt; import Crypto.KDF.HKDF
ghci&gt; import Crypto.Hash (SHA256)
ghci&gt; let pkr = extract ("salt" :: ByteString) ("secret" :: ByteString) :: PRK SHA256
ghci| in expand pkr ("payload" :: ByteString) 32 :: ByteString
"\DC4\147\223\v%\175\f\177\143\132\202\142\233\236\135\153\253\CANs\213wh\149\193\128\240\192t\DC1\UST,"
</pre>
</div>
</div>
</div>
<div id="outline-container-orge0161ed" class="outline-2">
<h2 id="orge0161ed">Symmetric Ciphers</h2>
<div class="outline-text-2" id="text-orge0161ed">
</div>
<div id="outline-container-org35b7d8d" class="outline-3">
<h3 id="org35b7d8d">AES</h3>
<div class="outline-text-3" id="text-org35b7d8d">
<p>
AES requires a initial vector(IV), aka nonce
</p>
</div>

<div id="outline-container-org673c0ba" class="outline-4">
<h4 id="org673c0ba">Counter Mode(CTR)</h4>
<div class="outline-text-4" id="text-org673c0ba">
<p>
The following is a example of AES CTR mode with a random key and 0 iv:
</p>
<div class="epigraph"><blockquote>
<p>
In practice key should be generated from one of the secure KDF, and iv should be a random number.
</p>

</blockquote></div>

<pre class="example" id="org3d7e42e">
ghci&gt; import Crypto.Random
ghci&gt; import Crypto.Cipher.Types
ghci&gt; import Crypto.Cipher.AES (AES256)
ghci&gt; import Crypto.Error
ghci&gt; do
ghci| cipher &lt;- (getRandomBytes 32 :: IO ByteString) &gt;&gt;= (throwCryptoErrorIO . cipherInit) :: IO AES256
ghci| return $ ctrCombine cipher nullIV ("message"::ByteString)
ghci| 
"\208\207\SI\191\206\DELN"
</pre>
</div>
</div>

<div id="outline-container-org6c634b0" class="outline-4">
<h4 id="org6c634b0">Galois/Counter Mode<label for="20" class="margin-toggle sidenote-number"></label><input type="checkbox" id="20" class="margin-toggle"/><span class="sidenote">
<a href="https://csrc.nist.gov/publications/detail/sp/800-38d/final">https://csrc.nist.gov/publications/detail/sp/800-38d/final</a>
</span> Synthetic Initialization Vector (GCM-SIV)<label for="21" class="margin-toggle sidenote-number"></label><input type="checkbox" id="21" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc8452">https://datatracker.ietf.org/doc/html/rfc8452</a>
</span></h4>
<div class="outline-text-4" id="text-org6c634b0">
<p>
CTR is good enough for common encryption case, while GCM added Authenticated Encryption with Additional Data (AEAD)<label for="22" class="margin-toggle sidenote-number"></label><input type="checkbox" id="22" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc5116">https://datatracker.ietf.org/doc/html/rfc5116</a>
</span>, and SIV to nonce misuse-resistant.
</p>

<p>
AEAD basically bind extra data, or context to cipher text and generate a MAC, aka authentication tag, to be able to verify cipher text's integrity(not tampered), and authenticity(not cut-and-paste).
</p>

<p>
The following is example of AES-GCM-SIV encryption of "message" with additional data "context" and a nonce.
</p>

<pre class="example" id="org7bb7b8a">
ghci&gt; import Crypto.Cipher.AESGCMSIV
ghci&gt; do
ghci| key :: ByteString &lt;- getRandomBytes 32
ghci| nonce &lt;- generateNonce
ghci| throwCryptoErrorIO $ do
ghci| aes :: AES256 &lt;- cipherInit key
ghci| return $ encrypt aes nonce ("context" :: ByteString) ("message" :: ByteString) 
ghci| 
(AuthTag {unAuthTag = "\239|\229V\USNT3\ACKf\NAK\STXC\251\134\FS"},"\149\229\142SW\209Z")
</pre>
</div>
</div>
</div>
<div id="outline-container-org06e81f3" class="outline-3">
<h3 id="org06e81f3">ChaCha20</h3>
<div class="outline-text-3" id="text-org06e81f3">
<p>
ChaCha20 is high speed stream cipher, a vairant of Salsa20, usually combine with Poly1305 as AEAD construction.
</p>
</div>
<div id="outline-container-orgb602646" class="outline-4">
<h4 id="orgb602646">ChaCha20-Poly1305<label for="15" class="margin-toggle sidenote-number"></label><input type="checkbox" id="15" class="margin-toggle"/><span class="sidenote">
<a href="https://datatracker.ietf.org/doc/html/rfc8439">https://datatracker.ietf.org/doc/html/rfc8439</a>
</span></h4>
<div class="outline-text-4" id="text-orgb602646">
<p>
ChaCha20-Poly1305 requires very similar inputs to AES:
</p>

<ul class="org-ul">
<li>a 32 bytes (256-bit) key, can derive key from password with a secure KDF</li>
<li>a 12 bytes (96-bit) nonce aka IV</li>
</ul>

<p>
There are more steps to encrypt a message due to it is stream cipher aka state cipher, which is different from block cipher such as AES, block cipher generate fixed length key to encrypt fixed length message, while stream cipher can produce state to generate keystream for next chunk of data.
</p>

<ul class="org-ul">
<li>AEAD need to add and finalize before encrypt, and cannot modify later on</li>
<li>encrypt can call multiple times based on current state</li>
<li>finalise a state will generate auth tag</li>
</ul>

<pre class="example" id="org914333c">
ghci&gt; import Crypto.Error
ghci&gt; import Crypto.Cipher.ChaChaPoly1305
ghci| do
ghci| key &lt;- getRandomBytes 32 :: IO ByteString
ghci| nonce &lt;- getRandomBytes 12 :: IO ByteString
ghci| throwCryptoErrorIO $ do
ghci| st1 &lt;- nonce12 nonce &gt;&gt;= initialize key
ghci| let
ghci|   st2 = finalizeAAD $ appendAAD ("context":: ByteString) st1
ghci|   (out, st3) = encrypt ("message":: ByteString) st2
ghci|   auth = finalize st3
ghci| return $ (convertToBase Base16 out :: ByteString, convertToBase Base16 auth :: ByteString)
("f0dd593fb3cac0","4a29dd7ae8b51ac748b37092ed485e88")
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0f69fc6" class="outline-2">
<h2 id="org0f69fc6"><span class="todo TODO">TODO</span> Asymmetric Ciphers</h2>
</div>
